Repository: gaurapanasenko/timetable
Catalog: timetableapp/locale/*/LC_MESSAGES/django.po
Languages: uk

source: faculty
uk: об'єкт "Факультет"

source: department
uk: об'єкт "Кафедра"

source: person
uk: об'єкт "Особа"

source: building
uk: об'єкт "Будинок"

source: year
uk: рік

source: specialty
uk: об'єкт "Спеціальність"

source: form
uk: форма

source: group stream
uk: об'єкт "Груповий потік"

source: group
uk: об'єкт "Група"

source: subjects
uk: предмети

source: lesson
uk: об'єкт "Заняття"

source: subgroup
uk: об'єкт "Підгрупа"

source: classroom
uk: об'єкт "Аудиторія"

source: teacher
uk: об'єкт "Вчитель"

source: semester
uk: семестр

source: subject
uk: об'єкт "Предмет"

source: Timetable Application
uk: Додаток "Розклад"

source: Date ranges are overlapping.
uk: Діапазони дат перекриваються.

source: You must have at least one {}.
uk: Ви повинні мати принаймні одну {}.

source: You may not have {} more than {}.
uk: Ви не можете мати {} більше, ніж {}.

source: name
uk: назва

source: abbreviation
uk: абревіатура

source: faculties
uk: факультети

source: departments
uk: кафедри

source: first name
uk: ім'я

source: middle name
uk: по батькові

source: last name
uk: прізвище

source: persons
uk: особи

source: teachers
uk: вчителі

source: number
uk: номер

source: specialties
uk: спеціальності

source: address
uk: адреса

source: longitude
uk: довгота

source: latitude
uk: широта

source: buildings
uk: будинки

source: classrooms
uk: аудиторії

source: suffix
uk: суфікс

source: number of semesters
uk: кількість семестрів

source: Total number of semesters, later if you specify fewer Semester date ranges than Number of semesters they will cycle from beginning automatically.
uk: Загальна кількість семестрів, пізніше, якщо ви вкажете меншу кількість діапазонів дат семестрів, ніж кількість семестрів, вони автоматично зацикляться від початку.

source: priority
uk: пріоритет

source: form of study
uk: об'єкт "Форма навчання"

source: forms of study
uk: форми навчання

source: default date range
uk: діапазон дат за умовчанням

source: default date range for semester
uk: діапазон дат за умовчанням для семестру

source: semester date range
uk: семестровий діапазон дат

source: semester date ranges
uk: семестрові діапазони дат

source: group streams
uk: групові потоки

source: If is zero then it will be union of groups in group stream.
uk: Якщо дорівнює нулю, то це буде об'єднання груп у груповий потік.

source: groups
uk: групи

source: numerator
uk: чисельник

source: Index of subgroup.
uk: Індекс підгрупи.

source: denominator
uk: знаменник

source: Total number of subgroups in this type of subgroup.
uk: Загальна кількість підгруп у цьому типі підгрупи.

source: Group is union of groups, so numerator and denominator must be zero.
uk: Група - це об'єднання груп, тому чисельник і знаменник повинні бути нульовими.

source: If group is not union of groups, numerator can not be zero.
uk: Якщо група не є об'єднанням груп, чисельник не може дорівнювати нулю.

source: Numerator must be lower or equal to denominator.
uk: Чисельник повинен бути меншим або рівним знаменнику.

source: subgroups
uk: підгрупи

source: start date
uk: дата початку

source: end date
uk: дата закінчення

source: End date should be greater than start date.
uk: Кінцева дата повинна бути більшою, ніж дата початку.

source: curriculum
uk: об'єкт "Навчальний план"

source: curriculums
uk: навчальні плани

source: number of lectures
uk: кількість лекцій

source: number of practices
uk: кількість практик

source: number of laboratory
uk: кількість лабораторних занять

source: amount of independent work
uk: кількість самостійної роботи

source: curriculum record
uk: об'єкт "Запис навчальної програми"

source: curriculum records
uk: записи навчальної програми

source: Duplicate teacher for lesson by {}.
uk: Дублікат вчителя для заняття через групу {}.

source: lessons
uk: об'єкт "Заняття"

source: lesson number
uk: номер заняття

source: Duplicate time table recording by {}.
uk: Дублікат запису розкладу занять через {}.

source: timetable recording
uk: об'єкт "Запис розкладу"

source: timetable recordings
uk: записи розкладу
